# IsValidViewTemplate Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..IsValidViewTemplate Method
View Class See Also
---
Verifies that the view represented by templateId can be set as the controlling view template for this view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsValidViewTemplate(
	ElementId templateId
)
```

Visual Basic
---
```text
Public Function IsValidViewTemplate ( _
	templateId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidViewTemplate(
	ElementId^ templateId
)
```

# ### Parameters
templateId
    Type: Autodesk.Revit.DB..::..ElementId The id to be validated as a view template for this view.
# ### Return Value
True if the view is valid for us as a view template and compatible with this view, or if it is InvalidElementId, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
View Class
Autodesk.Revit.DB Namespace